onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/InformationRegisters/бит_омни_Команды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_омни_Команды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Действия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/InformationRegisters/бит_омни_ИсторияЧатовMAX.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_омни_ИсторияЧатовMAX</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОтправителя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_омни_ВидыОтправителейMAX</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Контакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Боты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Входящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Enums/бит_омни_КаналыСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_омни_КаналыСвязи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>MAX</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Enums/бит_омни_ВидыОтправителейMAX.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_омни_ВидыОтправителейMAX</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пациент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оператор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Контакты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_Контакты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_омни_КаналыСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Боты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Действия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_Действия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШаблоныСообщений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_омни_ШаблоныСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбозначениеВАлгоритме</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/CommonModules/бит_омни_ИнтеграцияСMAX/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ИнформацияОБоте(Токен) Экспорт

	Соединение = бит_омни_ИнтеграцияСMAXПовтИсп.СоединениеCAPI();
	Заголовки = ЗаголовкиMAX(Токен);

	Запрос = Новый HTTPЗапрос("/me", Заголовки);
	Ответ = Соединение.Получить(Запрос);

	ДанныеОтвета = ПрочитатьОтветMAX(Ответ);
	Если Ответ.КодСостояния <> 200 Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Код ошибки: %1
														|Текст ошибки: %2", Ответ.КодСостояния, ДанныеОтвета.Текст));
		Возврат Неопределено;
	КонецЕсли;

	Возврат ДанныеОтвета.Тело;

КонецФункции

// Отправляет текстовое сообщение через бота в мессенджер MAX с возможностью указания форматирования.
//
// Параметры:
//   ТекстСообщения - Строка - текст отправляемого сообщения
//   Получатель - - получатель сообщения
//     - Массив из СправочникСсылка.бит_омни_Контакты, СправочникСсылка.Сотрудники, СправочникСсылка.Клиенты  
//     - СправочникСсылка.бит_омни_Контакты
//     - СправочникСсылка.Сотрудники
//     - СправочникСсылка.Клиенты
//   Бот - СправочникСсылка.бит_омни_Боты - идентификатор бота, от имени которого отправляется сообщение
//   Формат - Строка - форматирование текста сообщения (например, "markdown", "html")
//           - Неопределено - используется форматирование по умолчанию
//
// Возвращаемое значение:
//   см. бит_омни_ИнтеграцияСMAX.ОтправитьСообщение
Функция ОтправитьТекстовоеСообщение(ТекстСообщения, Получатель, Бот, Формат = Неопределено,
	ВидОтправителя = Неопределено, Пользователь = Неопределено) Экспорт

	ПараметрыСообщения = Новый Структура("text", ТекстСообщения);

	Если ЗначениеЗаполнено(Формат) Тогда
		ПараметрыСообщения.Вставить("format", Формат);
	КонецЕсли;

	Возврат ОтправитьСообщение(ПараметрыСообщения, Получатель, Бот, , ВидОтправителя, Пользователь);

КонецФункции

// Отправляет сообщение через интеграцию с MAX одному или нескольким получателям
//
// Параметры:
//   ПараметрыСообщения - Структура, СправочникСсылка.бит_омни_ШаблоныСообщений - параметры сообщения (зависят от типа сообщения)
//   Получатель - Строка, Массив из Строка - идентификатор получателя или массив получателей
//   Бот - Строка - идентификатор бота
//   Контекст - Структура, Неопределено - дополнительные параметры для отправки сообщения
//
// Возвращаемое значение:
//   см. бит_омни_ИнтеграцияСMAX.ОтправитьСообщениеПолучателю
Функция ОтправитьСообщение(ПараметрыСообщения, Получатель, Бот, Контекст = Неопределено,
	ВидОтправителя = Неопределено, Пользователь = Неопределено) Экспорт

	ДанныеБота = бит_омни_ИнтеграцияСMAXПовтИсп.ДанныеБота(Бот);
	Если ДанныеБота = Неопределено Тогда
		Возврат Новый Структура("success, message", Ложь, НСтр("ru='Не найден бот MAX'"));
	КонецЕсли;

	Получатели = ПолучателиСообщенияMAX(Получатель);
	Если ТипЗнч(Получатель) = Тип("Массив") Тогда

		РезультатыОтправки = Новый Массив;
		Для Каждого ТекущийПолучатель Из Получатели Цикл
			РезультатыОтправки.Добавить(ОтправитьСообщениеПолучателю(ПараметрыСообщения, ТекущийПолучатель, Бот,
				ДанныеБота, Контекст, ВидОтправителя, Пользователь));
		КонецЦикла;

		Возврат РезультатыОтправки;

	КонецЕсли;

	Если Получатели.Количество() = 0 Тогда
		Возврат Новый Структура("success, message", Ложь, НСтр("ru='Не определен получатель сообщения MAX'"));
	КонецЕсли;

	Возврат ОтправитьСообщениеПолучателю(ПараметрыСообщения, Получатели[0], Бот, ДанныеБота, Контекст,
		ВидОтправителя, Пользователь);

КонецФункции

Функция ОтправитьСообщениеПолучателю(ПараметрыСообщения, Получатель, Бот, ДанныеБота, Контекст,
	ВидОтправителя = Неопределено, Пользователь = Неопределено)

	ПолучательСообщения = ПолучательСообщенияMAX(Получатель, Бот);
	Адресат = ПараметрыАдресата(ПолучательСообщения, Бот);
	Если Адресат = Неопределено Тогда
		Возврат Новый Структура("success, message", Ложь, НСтр("ru='Не определен получатель сообщения MAX'"));
	КонецЕсли;

	ПараметрыТекущегоСообщения = ПараметрыСообщенияMAX(
		ПараметрыСообщения, ПолучательСообщения, Контекст, ДанныеБота);
	ТелоСообщения = ТелоСообщенияMAX(ПараметрыТекущегоСообщения);
	Если ТелоСообщения = Неопределено Тогда
		Возврат Новый Структура("success, message", Ложь, НСтр("ru='Не заполнен текст или вложения сообщения MAX'"));
	КонецЕсли;

	СтрокаЗапроса = СтруктураВJSON(ТелоСообщения);

	Соединение = бит_омни_ИнтеграцияСMAXПовтИсп.СоединениеCAPI();
	Заголовки = ЗаголовкиMAX(ДанныеБота.Токен);
	Заголовки.Вставить("Content-Type", "application/json");

	Ресурс = СтрШаблон("/messages?%1=%2", Адресат.Параметр, Адресат.Значение);
	Запрос = Новый HTTPЗапрос(Ресурс, Заголовки);
	Запрос.УстановитьТелоИзСтроки(СтрокаЗапроса, КодировкаТекста.UTF8);

	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	ДанныеОтвета = ПрочитатьОтветMAX(Ответ);

	Если Ответ.КодСостояния < 200 Или Ответ.КодСостояния >= 300 Тогда
		ЗаписьЖурналаРегистрации(
			"ОМНИ.MAX.ОшибкаОтправки", УровеньЖурналаРегистрации.Ошибка, , , СтрШаблон(
			"Код ответа MAX: %1. Тело ответа: %2", Ответ.КодСостояния, ДанныеОтвета.Текст));
	КонецЕсли;

	ЗаписатьИсходящееСообщениеMAX(
		ТелоСообщения, ПолучательСообщения, Бот, ДанныеОтвета.Тело, Ответ.КодСостояния, ДанныеОтвета.Текст,
		ВидОтправителя, Пользователь);

	Возврат ДанныеОтвета.Тело;

КонецФункции

Функция ОбработатьWebhook(HTTPЗапрос, Бот) Экспорт

	Попытка
		Обновление = бит_омни_ИнтеграцияСервер.ТелоЗапросаВСтруктуру(HTTPЗапрос);
		Если ТипЗнч(Обновление) <> Тип("Структура") Тогда
			Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("invalid_max_update");
		КонецЕсли;

		ОбработатьОбновление(Обновление, Бот);

		Возврат бит_омни_ИнтеграцияСервер.УспешныйОтвет(Новый Структура("success", Истина));

	Исключение
		ИнфоОшибки = ИнформацияОбОшибке();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнфоОшибки);

		ЗаписьЖурналаРегистрации(
			"ОМНИ.MAX.Webhook", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);

		Возврат бит_омни_ИнтеграцияСервер.ОтветСОшибкой("max_webhook_error", 500, ТекстОшибки);
	КонецПопытки;

КонецФункции

Процедура ОбработатьОбновление(Обновление, Бот) Экспорт

	ТипОбновления = СтроковоеСвойство(Обновление, "update_type");

	Если ТипОбновления = "message_created" Тогда
		ОбработатьСозданиеСообщения(Обновление, Бот);
	ИначеЕсли ТипОбновления = "bot_started" Тогда
		ОбработатьЗапускБота(Обновление, Бот);
	ИначеЕсли ТипОбновления = "bot_stopped" Тогда
		ОбработатьОстановкуБота(Обновление, Бот);
	ИначеЕсли ТипОбновления = "message_callback" Тогда
		ОбработатьCallback(Обновление, Бот);
	Иначе
		ЗаписатьСобытиеВЖурнал(Обновление, Бот, НСтр("ru='Событие MAX пропущено'"));
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьКонтактПоUser(User, Бот) Экспорт

	Если ТипЗнч(User) <> Тип("Структура") Тогда
		Возврат Справочники.бит_омни_Контакты.ПустаяСсылка();
	КонецЕсли;

	ДанныеБота = бит_омни_ИнтеграцияСMAXПовтИсп.ДанныеБота(Бот);
	Если ДанныеБота = Неопределено Тогда
		Возврат Справочники.бит_омни_Контакты.ПустаяСсылка();
	КонецЕсли;

	ИдентификаторПользователя = ЗначениеСвойства(User, "user_id");
	Если Не ЗначениеЗаполнено(ИдентификаторПользователя) Тогда
		Возврат Справочники.бит_омни_Контакты.ПустаяСсылка();
	КонецЕсли;

	Контакт = НайтиКонтактMAX(ИдентификаторПользователя, ДанныеБота.Ссылка);
	Если Не Контакт.Пустая() Тогда
		Возврат Контакт;
	КонецЕсли;

	КонтактОбъект = Справочники.бит_омни_Контакты.СоздатьЭлемент();
	КонтактОбъект.Наименование = Лев(ПредставлениеПользователяMAX(User), 25);
	КонтактОбъект.Идентификатор = ИдентификаторПользователя;
	КонтактОбъект.Канал = Перечисления.бит_омни_КаналыСвязи.MAX;
	КонтактОбъект.Бот = ДанныеБота.Ссылка;
	КонтактОбъект.ОбменДанными.Загрузка = Истина;
	КонтактОбъект.ДополнительныеСвойства.Вставить("НеРегистрироватьДляОбмена", Истина);
	КонтактОбъект.Записать();

	Возврат КонтактОбъект.Ссылка;

КонецФункции

#КонецОбласти

#Область ОбработкаВходящихСобытий

Процедура ОбработатьСозданиеСообщения(Обновление, Бот)

	Сообщение = ЗначениеСвойства(Обновление, "message");
	Если ТипЗнч(Сообщение) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Отправитель = ЗначениеСвойства(Сообщение, "sender");
	Если ЗначениеСвойства(Отправитель, "is_bot", Ложь) Тогда
		Возврат;
	КонецЕсли;

	Контакт = ПолучитьКонтактПоUser(Отправитель, Бот);
	ТекстСообщения = ТекстСообщенияMAX(Сообщение);

	ЗаписатьВходящееСообщениеMAX(Сообщение, Контакт, Бот);

	Если ЭтоКомандаMAX(ТекстСообщения) Тогда
		ОбработатьКоманду(Сообщение, Контакт, Бот, КомандаИзТекста(ТекстСообщения));
	Иначе
		ОбработатьСообщение(Сообщение, Контакт, Бот);
	КонецЕсли;

	ЗаписатьСобытиеВЖурнал(Обновление, Бот, НСтр("ru='Получено сообщение MAX'"));

КонецПроцедуры

Процедура ОбработатьЗапускБота(Обновление, Бот)

	User = ЗначениеСвойства(Обновление, "user");
	Контакт = ПолучитьКонтактПоUser(User, Бот);

	Если Контакт.Пустая() Тогда
		Возврат;
	КонецЕсли;

	УстановитьБлокировкуКонтакта(Контакт, Ложь);

	Если Не ЗначениеЗаполнено(Контакт.Получатель)
		И ОтправитьСтандартноеСообщениеMAX("MAX_WELCOME", Контакт, Бот)
	Тогда
		ЗаписатьСобытиеВЖурнал(Обновление, Бот, НСтр("ru='Отправлено приветствие MAX'"));
		Возврат;
	КонецЕсли;

	Сообщение = Новый Структура;
	Сообщение.Вставить("sender", User);
	Сообщение.Вставить("timestamp", ЗначениеСвойства(Обновление, "timestamp"));

	Payload = СтроковоеСвойство(Обновление, "payload");
	Сообщение.Вставить("body", Новый Структура("text, mid", "/start " + Payload, СтроковоеСвойство(Обновление,
		"timestamp")));

	ОбработатьКоманду(Сообщение, Контакт, Бот, "/start");

	ЗаписатьСобытиеВЖурнал(Обновление, Бот, НСтр("ru='Пользователь запустил бота MAX'"));

КонецПроцедуры

Процедура ОбработатьОстановкуБота(Обновление, Бот)

	Контакт = ПолучитьКонтактПоUser(ЗначениеСвойства(Обновление, "user"), Бот);
	Если Не Контакт.Пустая() Тогда
		УстановитьБлокировкуКонтакта(Контакт, Истина);
	КонецЕсли;

	ЗаписатьСобытиеВЖурнал(Обновление, Бот, НСтр("ru='Пользователь остановил бота MAX'"));

КонецПроцедуры

Процедура ОбработатьCallback(Обновление, Бот)

	Обработчик = бит_омни_ИнтеграцияСMAXПовтИсп.ОбработчикКоманды("callback");
	Если ПустаяСтрока(Обработчик) Тогда
		ЗаписатьСобытиеВЖурнал(Обновление, Бот, НСтр("ru='Callback MAX пропущен'"));
		Возврат;
	КонецЕсли;

	ВыполнитьОбработчик(Обработчик, Обновление, Справочники.бит_омни_Контакты.ПустаяСсылка(), Бот);

КонецПроцедуры

Процедура ОбработатьСообщение(Сообщение, Контакт, Бот)

	ТелоСообщения = ЗначениеСвойства(Сообщение, "body");
	Вложения = ЗначениеСвойства(ТелоСообщения, "attachments");
	Если ТипЗнч(Вложения) = Тип("Массив") И Вложения.Количество() Тогда
		ПервоеВложение = Вложения.Получить(0);
		Если ПервоеВложение.type = "contact" Тогда
			ИнформацияОКонтакте = ЗначениеСвойства(ПервоеВложение, "payload");
			ОбработатьПолученныйКонтактMAX(ИнформацияОКонтакте, Контакт, Бот);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Обработчик = бит_омни_ИнтеграцияСMAXПовтИсп.ОбработчикСообщения();
	Если ПустаяСтрока(Обработчик) Тогда
		Возврат;
	КонецЕсли;

	ВыполнитьОбработчик(Обработчик, Сообщение, Контакт, Бот);

КонецПроцедуры

Процедура ОбработатьКоманду(Сообщение, Контакт, Бот, Команда, Параметры = Неопределено)

	ИмяКоманды = СокрЛП(Команда);
	Если Лев(ИмяКоманды, 1) = "/" Тогда
		ИмяКоманды = Сред(ИмяКоманды, 2);
	КонецЕсли;

	ДействиеКоманды = РегистрыСведений.бит_омни_Команды.СоздатьМенеджерЗаписи();
	ДействиеКоманды.Команда = ИмяКоманды;
	ДействиеКоманды.Прочитать();

	Если ДействиеКоманды.Выбран() И Не ДействиеКоманды.Действие.Пустая() Тогда

		Результат = Справочники.бит_омни_Действия.ВыполнитьДействие(ДействиеКоманды.Действие, Сообщение.body.text,
			Контакт, Бот, Параметры);

		Если Не Результат.Ошибка Тогда
			Возврат;
		КонецЕсли;

		ЗаписьЖурналаРегистрации("ОМНИ.MAX.Команды", УровеньЖурналаРегистрации.Ошибка, , ДействиеКоманды.Действие,
			Результат.Описание);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаголовкиMAX(Токен)

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", Токен);

	Возврат Заголовки;

КонецФункции

Функция ПрочитатьОтветMAX(Ответ)

	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	ТелоОтвета = Неопределено;

	Если Не ПустаяСтрока(ТекстОтвета) Тогда
		Попытка
			ТелоОтвета = JSONВСтруктуру(ТекстОтвета);
		Исключение
			ТелоОтвета = Новый Структура("raw", ТекстОтвета);
		КонецПопытки;
	КонецЕсли;

	Возврат Новый Структура("Текст, Тело", ТекстОтвета, ТелоОтвета);

КонецФункции

Функция JSONВСтруктуру(СтрокаJSON)

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Возврат ПрочитатьJSON(Чтение);

КонецФункции

Функция СтруктураВJSON(Данные)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);

	Возврат ЗаписьJSON.Закрыть();

КонецФункции

Функция ПараметрыСообщенияMAX(ПараметрыСообщения, Получатель, Контекст, ДанныеБота)

	Если Не ЭтоШаблонСообщенияMAX(ПараметрыСообщения) Тогда
		Возврат ПараметрыСообщения;
	КонецЕсли;

	ТекстСообщения = бит_омни_РаботаССообщениями.СформироватьТекстСообщенияПоШаблону(ПараметрыСообщения, Получатель,
		Контекст);
	ПараметрыТекущегоСообщения = Новый Структура("text", ТекстСообщения);

	Формат = ПараметрыСообщения.ВариантФормата;
	Если ЗначениеЗаполнено(Формат) Тогда
		ПараметрыТекущегоСообщения.Вставить("format", НРег(Формат));
	КонецЕсли;

	Кнопки = Справочники.бит_омни_ШаблоныСообщений.СформироватьКнопкиПоШаблону(
		ПараметрыСообщения, Получатель, Контекст);
	Если Кнопки.Количество() > 0 Тогда
		ЗаполнитьWebAppКнопокMAX(Кнопки, ДанныеБота);
		Вложения = Новый Массив;
		Вложения.Добавить(Новый Структура(
			"type, payload", "inline_keyboard", Новый Структура("buttons", Кнопки)));
		ПараметрыТекущегоСообщения.Вставить("attachments", Вложения);
	КонецЕсли;

	Возврат ПараметрыТекущегоСообщения;

КонецФункции

Процедура ЗаполнитьWebAppКнопокMAX(РядыКнопок, ДанныеБота)

	ИмяWebApp = СокрЛП(Строка(ДанныеБота.Ссылка.ИмяПользователя));
	Для Каждого РядКнопок Из РядыКнопок Цикл
		Для Каждого Кнопка Из РядКнопок Цикл
			Если СтроковоеСвойство(Кнопка, "type") = "open_app"
				И ПустаяСтрока(СтроковоеСвойство(Кнопка, "web_app"))
			Тогда
				Кнопка.Вставить("web_app", ИмяWebApp);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработатьПолученныйКонтактMAX(ИнформацияОКонтакте, Контакт, Бот)

	Если ТипЗнч(ИнформацияОКонтакте) <> Тип("Структура")
		Или Контакт.Пустая()
	Тогда
		ОтправитьОтказВАторизацииMAX(Контакт, Бот, "Некорректные данные контакта");
		Возврат;
	КонецЕсли;

	ИнформацияОбАккаунтеMAX = ЗначениеСвойства(ИнформацияОКонтакте, "max_info");
	ИдентификаторКонтакта = ЗначениеСвойства(ИнформацияОбАккаунтеMAX, "user_id");
	Если СтрокаИдентификатора(ИдентификаторКонтакта) <> СтрокаИдентификатора(Контакт.Идентификатор) Тогда
		ОтправитьОтказВАторизацииMAX(Контакт, Бот, "Контакт принадлежит другому пользователю MAX");
		Возврат;
	КонецЕсли;

	VCF = ЗначениеСвойства(ИнформацияОКонтакте, "vcf_info", "");
	Если VCF = Неопределено Или VCF = Null Тогда
		VCF = "";
	Иначе
		// Завершающий перенос строки входит в подписываемые MAX данные VCard.
		// СтроковоеСвойство() здесь применять нельзя: СокрЛП() удалит этот перенос.
		VCF = Строка(VCF);
	КонецЕсли;
	VCF = НормализоватьVCFMAX(VCF);
	Хеш = НРег(СтроковоеСвойство(ИнформацияОКонтакте, "hash"));
	Если ПустаяСтрока(VCF)
		Или ПустаяСтрока(Хеш)
		Или Не ХешиРавныMAX(Хеш, HMACSHA256MAX(Бот.Токен, VCF))
	Тогда
		ОтправитьОтказВАторизацииMAX(Контакт, Бот, "Не подтверждена подпись контакта MAX");
		Возврат;
	КонецЕсли;

	НомерТелефона = НомерТелефонаИзVCFMAX(VCF);
	Если ПустаяСтрока(НомерТелефона) Тогда
		ОтправитьОтказВАторизацииMAX(Контакт, Бот, "В контакте отсутствует номер телефона");
		Возврат;
	КонецЕсли;

	ВидКонтактнойИнформации = бит_омни_ОбщегоНазначенияПолныеПрава.ЗначениеКонстанты(
		"ВидКонтактнойИнформации_ДляПоискаКлиента");
	НайденныеКонтакты = бит_омни_КонтактнаяИнформацияСерверПереопределяемый.НайтиОбъектыПоНомеруТелефона(
		НомерТелефона, Тип("СправочникСсылка.Клиенты"), Истина, ВидКонтактнойИнформации);

	Клиенты = Новый Массив;
	Для Каждого НайденныйКонтакт Из НайденныеКонтакты Цикл
		Если Клиенты.Найти(НайденныйКонтакт.Объект) = Неопределено Тогда
			Клиенты.Добавить(НайденныйКонтакт.Объект);
		КонецЕсли;
	КонецЦикла;

	Если Клиенты.Количество() <> 1 Тогда
		ОтправитьОтказВАторизацииMAX(
			Контакт, Бот, ?(Клиенты.Количество() = 0, "Клиент по номеру не найден", "Найдено несколько клиентов"));
		Возврат;
	КонецЕсли;

	Клиент = Клиенты[0];
	Если ЗначениеЗаполнено(Контакт.Получатель) И Контакт.Получатель <> Клиент Тогда
		ОтправитьОтказВАторизацииMAX(Контакт, Бот, "Контакт уже привязан к другому клиенту");
		Возврат;
	КонецЕсли;

	КонтактОбъект = Контакт.ПолучитьОбъект();
	КонтактОбъект.Получатель = Клиент;
	КонтактОбъект.ОбменДанными.Загрузка = Истина;
	КонтактОбъект.ДополнительныеСвойства.Вставить("НеРегистрироватьДляОбмена", Истина);
	КонтактОбъект.Записать();

	бит_омни_КонтактнаяИнформацияСерверПереопределяемый.ПослеПривязкиПользователяМессенджера(
		КонтактОбъект.Ссылка, Клиент, Бот, ИнформацияОКонтакте);

	Контекст = Новый Структура("client_name, phone", Строка(Клиент), НомерТелефона);
	Если Не ОтправитьСтандартноеСообщениеMAX("MAX_AUTH_SUCCESS", КонтактОбъект.Ссылка, Бот, Контекст) Тогда
		ОтправитьТекстовоеСообщение(
			"Авторизация прошла успешно.", КонтактОбъект.Ссылка, Бот);
	КонецЕсли;

КонецПроцедуры

Процедура ОтправитьОтказВАторизацииMAX(Контакт, Бот, Причина)

	ЗаписьЖурналаРегистрации(
		"ОМНИ.MAX.Авторизация", УровеньЖурналаРегистрации.Предупреждение, , Контакт, Причина);

	Если Контакт.Пустая() Тогда
		Возврат;
	КонецЕсли;

	Если Не ОтправитьСтандартноеСообщениеMAX("MAX_AUTH_DENIED", Контакт, Бот, Новый Структура("reason", Причина)) Тогда
		ОтправитьТекстовоеСообщение(
			"Не удалось выполнить авторизацию. Пожалуйста, свяжитесь с клиникой.", Контакт, Бот);
	КонецЕсли;

КонецПроцедуры

Функция ОтправитьСтандартноеСообщениеMAX(ИдентификаторШаблона, Контакт, Бот, Контекст = Неопределено)

	Шаблон = Справочники.бит_омни_ШаблоныСообщений.СтандартныйШаблон(ИдентификаторШаблона);
	Если Шаблон.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;

	ОтправитьСообщение(Шаблон, Контакт, Бот, Контекст);
	Возврат Истина;

КонецФункции

Функция НормализоватьVCFMAX(VCF)

	Результат = СтрЗаменить(VCF, "\r\n", Символы.ВК + Символы.ПС);
	Результат = СтрЗаменить(Результат, "\n", Символы.ПС);
	Возврат Результат;

КонецФункции

Функция НомерТелефонаИзVCFMAX(VCF)

	СтрокиVCF = СтрРазделить(СтрЗаменить(VCF, Символы.ВК, ""), Символы.ПС, Ложь);
	Для Каждого СтрокаVCF Из СтрокиVCF Цикл
		Если Лев(ВРег(СтрокаVCF), 3) <> "TEL" Тогда
			Продолжить;
		КонецЕсли;

		ПозицияРазделителя = СтрНайти(СтрокаVCF, ":");
		Если ПозицияРазделителя > 0 Тогда
			Возврат СокрЛП(Сред(СтрокаVCF, ПозицияРазделителя + 1));
		КонецЕсли;
	КонецЦикла;

	Возврат "";

КонецФункции

Функция HMACSHA256MAX(Ключ, Данные)

	РазмерБлока = 64;
	БуферКлюча = ПолучитьБуферДвоичныхДанныхИзСтроки(Ключ, КодировкаТекста.UTF8, Ложь);

	Если БуферКлюча.Размер > РазмерБлока Тогда
		ХешКлюча = Новый ХешированиеДанных(ХешФункция.SHA256);
		ХешКлюча.Добавить(ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(БуферКлюча));
		БуферКлюча = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ХешКлюча.ХешСумма);
	КонецЕсли;

	КлючБлока = Новый БуферДвоичныхДанных(РазмерБлока);
	КлючБлока.Записать(0, БуферКлюча);

	ВнутреннийКлюч = Новый БуферДвоичныхДанных(РазмерБлока);
	ВнешнийКлюч = Новый БуферДвоичныхДанных(РазмерБлока);
	Для Индекс = 0 По РазмерБлока - 1 Цикл
		ВнутреннийКлюч.Установить(Индекс, 54);
		ВнешнийКлюч.Установить(Индекс, 92);
	КонецЦикла;
	ВнутреннийКлюч.ЗаписатьПобитовоеИсключительноеИли(0, КлючБлока);
	ВнешнийКлюч.ЗаписатьПобитовоеИсключительноеИли(0, КлючБлока);

	ВнутреннийХеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	ВнутреннийХеш.Добавить(ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(ВнутреннийКлюч));
	ВнутреннийХеш.Добавить(ПолучитьДвоичныеДанныеИзСтроки(Данные, КодировкаТекста.UTF8, Ложь));

	ВнешнийХеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	ВнешнийХеш.Добавить(ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(ВнешнийКлюч));
	ВнешнийХеш.Добавить(ВнутреннийХеш.ХешСумма);

	Возврат НРег(ПолучитьHexСтрокуИзДвоичныхДанных(ВнешнийХеш.ХешСумма));

КонецФункции

Функция ХешиРавныMAX(ПервыйХеш, ВторойХеш)

	Если СтрДлина(ПервыйХеш) <> СтрДлина(ВторойХеш) Тогда
		Возврат Ложь;
	КонецЕсли;

	РезультатСравнения = 0;
	Для Индекс = 1 По СтрДлина(ПервыйХеш) Цикл
		Если Сред(ПервыйХеш, Индекс, 1) <> Сред(ВторойХеш, Индекс, 1) Тогда
			РезультатСравнения = РезультатСравнения + 1;
		КонецЕсли;
	КонецЦикла;

	Возврат РезультатСравнения = 0;

КонецФункции

Функция ЭтоШаблонСообщенияMAX(ПараметрыСообщения)

	ТипПараметров = ТипЗнч(ПараметрыСообщения);

	Возврат ТипПараметров = Тип("СправочникСсылка.бит_омни_ШаблоныСообщений") Или ТипПараметров = Тип(
		"СправочникОбъект.бит_омни_ШаблоныСообщений");

КонецФункции

Функция ПолучателиСообщенияMAX(Получатели)

	Результат = Новый Массив;

	Если ТипЗнч(Получатели) = Тип("Массив") Тогда
		ИсходныеПолучатели = Получатели;
	Иначе
		ИсходныеПолучатели = Новый Массив;
		ИсходныеПолучатели.Добавить(Получатели);
	КонецЕсли;

	Для Каждого Получатель Из ИсходныеПолучатели Цикл

		Если Получатель = Неопределено Или Получатель = Null Тогда
			Продолжить;
		КонецЕсли;

		Если Результат.Найти(Получатель) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если ПолучательЗаблокированMAX(Получатель) Тогда
			Продолжить;
		КонецЕсли;

		Результат.Добавить(Получатель);

	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучательСообщенияMAX(Получатель, Бот)

	ДоступныеТипыПолучателей = ДоступныеТипыПолучателейMAX();

	Если ДоступныеТипыПолучателей.СодержитТип(ТипЗнч(Получатель)) Тогда
		Получатель = НайтиКонтактПоДанным1С(Получатель, Бот);
	КонецЕсли;

	Если Получатель.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Получатель;

КонецФункции

Функция ДоступныеТипыПолучателейMAX()

	Возврат Метаданные.Справочники.бит_омни_Контакты.Реквизиты.Получатель.Тип;

КонецФункции
Функция ПолучательЗаблокированMAX(Получатель)

	Если ТипЗнч(Получатель) <> Тип("СправочникСсылка.бит_омни_Контакты") Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Получатель.Пустая() Тогда
		Возврат Истина;
	КонецЕсли;

	РеквизитыПолучателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Получатель, "Заблокирован");
	Возврат РеквизитыПолучателя.Заблокирован;

КонецФункции

Функция ТелоСообщенияMAX(ПараметрыСообщения)

	Если ТипЗнч(ПараметрыСообщения) = Тип("Строка") Или ТипЗнч(ПараметрыСообщения) = Тип("ФорматированнаяСтрока") Тогда
		Возврат Новый Структура("text", Строка(ПараметрыСообщения));
	КонецЕсли;

	Если ТипЗнч(ПараметрыСообщения) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;

	ЕстьТекст = ЗначениеЗаполнено(СтроковоеСвойство(ПараметрыСообщения, "text"));
	ЕстьВложения = ЗначениеСвойства(ПараметрыСообщения, "attachments") <> Неопределено;

	Если Не ЕстьТекст И Не ЕстьВложения Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ПараметрыСообщения;

КонецФункции

Функция ПараметрыАдресата(Получатель, Бот)

	Если ТипЗнч(Получатель) = Тип("СправочникСсылка.бит_омни_Контакты") Тогда

		Если Получатель.Пустая() Тогда
			Возврат Неопределено;
		КонецЕсли;

		РеквизитыПолучателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Получатель, "Идентификатор");
		Если ЗначениеЗаполнено(РеквизитыПолучателя.Идентификатор) Тогда
			Возврат Новый Структура("Параметр, Значение", "user_id", СтрокаИдентификатора(
				РеквизитыПолучателя.Идентификатор));
		КонецЕсли;

		Возврат Неопределено;

	КонецЕсли;

	Если ТипЗнч(Получатель) = Тип("Структура") Тогда

		Если ЗначениеЗаполнено(ЗначениеСвойства(Получатель, "chat_id")) Тогда
			Возврат Новый Структура("Параметр, Значение", "chat_id", СтрокаИдентификатора(Получатель.chat_id));
		ИначеЕсли ЗначениеЗаполнено(ЗначениеСвойства(Получатель, "user_id")) Тогда
			Возврат Новый Структура("Параметр, Значение", "user_id", СтрокаИдентификатора(Получатель.user_id));
		КонецЕсли;

		Возврат Неопределено;

	КонецЕсли;

	Если ТипЗнч(Получатель) = Тип("Число") Или ТипЗнч(Получатель) = Тип("Строка") Тогда
		Возврат Новый Структура("Параметр, Значение", "user_id", СтрокаИдентификатора(Получатель));
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция НайтиКонтактПоДанным1С(Ссылка, Бот)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	бит_омни_Контакты.Ссылка КАК Ссылка
				   |ИЗ
				   |	Справочник.бит_омни_Контакты КАК бит_омни_Контакты
				   |ГДЕ
				   |	бит_омни_Контакты.Получатель = &Ссылка
				   |	И бит_омни_Контакты.Бот = &Бот
				   |	И бит_омни_Контакты.Канал = ЗНАЧЕНИЕ(Перечисление.бит_омни_КаналыСвязи.MAX)
				   |	И НЕ бит_омни_Контакты.ПометкаУдаления
				   |	И НЕ бит_омни_Контакты.Заблокирован";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Бот", Бот);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Справочники.бит_омни_Контакты.ПустаяСсылка();

КонецФункции
Функция НайтиКонтактMAX(ИдентификаторПользователя, Бот)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	бит_омни_Контакты.Ссылка КАК Ссылка
				   |ИЗ
				   |	Справочник.бит_омни_Контакты КАК бит_омни_Контакты
				   |ГДЕ
				   |	бит_омни_Контакты.Идентификатор = &Идентификатор
				   |	И бит_омни_Контакты.Бот = &Бот
				   |	И бит_омни_Контакты.Канал = ЗНАЧЕНИЕ(Перечисление.бит_омни_КаналыСвязи.MAX)
				   |	И НЕ бит_омни_Контакты.ПометкаУдаления";

	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторПользователя);
	Запрос.УстановитьПараметр("Бот", Бот);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	Возврат Справочники.бит_омни_Контакты.ПустаяСсылка();

КонецФункции

Процедура УстановитьБлокировкуКонтакта(Контакт, Заблокирован)

	Если Контакт.Пустая() Тогда
		Возврат;
	КонецЕсли;

	КонтактОбъект = Контакт.ПолучитьОбъект();
	Если КонтактОбъект.Заблокирован = Заблокирован Тогда
		Возврат;
	КонецЕсли;

	КонтактОбъект.Заблокирован = Заблокирован;
	КонтактОбъект.ОбменДанными.Загрузка = Истина;
	КонтактОбъект.ДополнительныеСвойства.Вставить("НеРегистрироватьДляОбмена", Истина);
	КонтактОбъект.Записать();

КонецПроцедуры

Функция ПредставлениеПользователяMAX(User)

	Имя = СтроковоеСвойство(User, "first_name");
	Фамилия = СтроковоеСвойство(User, "last_name");
	ИмяУстаревшее = СтроковоеСвойство(User, "name");
	Username = СтроковоеСвойство(User, "username");

	Представление = СокрЛП(Имя + " " + Фамилия);
	Если ПустаяСтрока(Представление) Тогда
		Представление = ИмяУстаревшее;
	КонецЕсли;

	Если ПустаяСтрока(Представление) Тогда
		Представление = Username;
	КонецЕсли;

	Если ПустаяСтрока(Представление) Тогда
		Представление = СтрокаИдентификатора(ЗначениеСвойства(User, "user_id"));
	КонецЕсли;

	Возврат Представление;

КонецФункции

Функция ТекстСообщенияMAX(Сообщение)

	Тело = ЗначениеСвойства(Сообщение, "body");
	Возврат СтроковоеСвойство(Тело, "text");

КонецФункции

Процедура ЗаписатьВходящееСообщениеMAX(Сообщение, Контакт, Бот)

	Если Контакт.Пустая() Тогда
		Возврат;
	КонецЕсли;

	Тело = ЗначениеСвойства(Сообщение, "body");
	ИдентификаторСообщения = СтроковоеСвойство(Тело, "mid");
	Если ПустаяСтрока(ИдентификаторСообщения) Тогда
		ИдентификаторСообщения = Строка(Новый УникальныйИдентификатор);
	ИначеЕсли СообщениеЧатаУжеЗаписаноMAX(ИдентификаторСообщения, Контакт, Бот, Истина) Тогда
		Возврат;
	КонецЕсли;

	Текст = СтроковоеСвойство(Тело, "text");
	Вложения = ЗначениеСвойства(Тело, "attachments");
	ВидСообщения = ВидСообщенияMAX(Вложения);
	Если ПустаяСтрока(Текст) И Не ПустаяСтрока(ВидСообщения) Тогда
		Текст = СтрШаблон("[Вложение: %1]", ВидСообщения);
	КонецЕсли;

	Отправитель = ЗначениеСвойства(Сообщение, "sender");
	ЗаписатьСообщениеЧатаMAX(
		ИдентификаторСообщения,
		Контакт,
		Бот,
		Истина,
		Текст,
		ВидСообщения,
		ПредставлениеПользователяMAX(Отправитель),
		"Получено",
		"",
		JSONВложенийMAX(Вложения));

КонецПроцедуры

Процедура ЗаписатьИсходящееСообщениеMAX(
		ТелоСообщения,
		Получатель,
		Бот,
		ОтветMAX,
		КодСостояния,
		ТекстОтвета,
		ВидОтправителя = Неопределено,
		Пользователь = Неопределено)

	Если ТипЗнч(Получатель) <> Тип("СправочникСсылка.бит_омни_Контакты")
		Или Получатель.Пустая()
	Тогда
		Возврат;
	КонецЕсли;

	ИдентификаторСообщения = ИдентификаторСообщенияИзОтветаMAX(ОтветMAX);
	Если ПустаяСтрока(ИдентификаторСообщения) Тогда
		ИдентификаторСообщения = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;

	Текст = СтроковоеСвойство(ТелоСообщения, "text");
	Вложения = ЗначениеСвойства(ТелоСообщения, "attachments");
	ВидСообщения = ВидСообщенияMAX(Вложения);
	Если ПустаяСтрока(Текст) И Не ПустаяСтрока(ВидСообщения) Тогда
		Текст = СтрШаблон("[Вложение: %1]", ВидСообщения);
	КонецЕсли;

	// Оператор передает себя явно, все остальные исходящие пишет бот.
	Если ВидОтправителя = Неопределено Тогда
		ВидОтправителя = Перечисления.бит_омни_ВидыОтправителейMAX.Бот;
	КонецЕсли;

	Если ВидОтправителя = Перечисления.бит_омни_ВидыОтправителейMAX.Оператор
		И ЗначениеЗаполнено(Пользователь) Тогда
		Автор = Строка(Пользователь);
	Иначе
		Автор = НСтр("ru='Клиника'");
	КонецЕсли;

	Успешно = КодСостояния >= 200 И КодСостояния < 300;
	ЗаписатьСообщениеЧатаMAX(
		ИдентификаторСообщения,
		Получатель,
		Бот,
		Ложь,
		Текст,
		ВидСообщения,
		Автор,
		?(Успешно, "Отправлено", "Ошибка"),
		?(Успешно, "", ТекстОтвета),
		JSONВложенийMAX(Вложения),
		ВидОтправителя,
		Пользователь);

КонецПроцедуры

Процедура ЗаписатьСообщениеЧатаMAX(
		ИдентификаторСообщения,
		Контакт,
		Бот,
		Входящее,
		Текст,
		ВидСообщения,
		Автор,
		Статус,
		ОписаниеОшибки,
		ДанныеВложений,
		ВидОтправителя = Неопределено,
		Пользователь = Неопределено)

	ДанныеБота = бит_омни_ИнтеграцияСMAXПовтИсп.ДанныеБота(Бот);
	Если ДанныеБота = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Запись = РегистрыСведений.бит_омни_ИсторияЧатовMAX.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДатаСеанса();
	Запись.ИдентификаторСообщения = Лев(ИдентификаторСообщения, 150);
	Запись.Контакт = Контакт;
	Запись.Бот = ДанныеБота.Ссылка;
	Запись.Входящее = Входящее;
	Запись.Текст = Текст;
	Запись.ВидСообщения = Лев(ВидСообщения, 50);
	Запись.Автор = Лев(Автор, 150);
	Запись.Прочитано = Не Входящее;
	Запись.Статус = Лев(Статус, 30);
	Запись.ОписаниеОшибки = ОписаниеОшибки;
	Запись.ДанныеВложений = ДанныеВложений;

	Если ВидОтправителя = Неопределено Тогда
		ВидОтправителя = ?(Входящее,
			Перечисления.бит_омни_ВидыОтправителейMAX.Пациент,
			Перечисления.бит_омни_ВидыОтправителейMAX.Бот);
	КонецЕсли;
	Запись.ВидОтправителя = ВидОтправителя;
	Запись.Пользователь = ?(Пользователь = Неопределено, Справочники.Пользователи.ПустаяСсылка(), Пользователь);

	Запись.Записать();

КонецПроцедуры

Функция СообщениеЧатаУжеЗаписаноMAX(ИдентификаторСообщения, Контакт, Бот, Входящее)

	ДанныеБота = бит_омни_ИнтеграцияСMAXПовтИсп.ДанныеБота(Бот);
	Если ДанныеБота = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	ИсторияЧатов.Период КАК Период
				   |ИЗ
				   |	РегистрСведений.бит_омни_ИсторияЧатовMAX КАК ИсторияЧатов
				   |ГДЕ
				   |	ИсторияЧатов.ИдентификаторСообщения = &ИдентификаторСообщения
				   |	И ИсторияЧатов.Контакт = &Контакт
				   |	И ИсторияЧатов.Бот = &Бот
				   |	И ИсторияЧатов.Входящее = &Входящее";

	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	Запрос.УстановитьПараметр("Контакт", Контакт);
	Запрос.УстановитьПараметр("Бот", ДанныеБота.Ссылка);
	Запрос.УстановитьПараметр("Входящее", Входящее);

	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

Функция ИдентификаторСообщенияИзОтветаMAX(ОтветMAX)

	Тело = ЗначениеСвойства(ОтветMAX, "body");
	Идентификатор = СтроковоеСвойство(Тело, "mid");
	Если Не ПустаяСтрока(Идентификатор) Тогда
		Возврат Идентификатор;
	КонецЕсли;

	Сообщение = ЗначениеСвойства(ОтветMAX, "message");
	Тело = ЗначениеСвойства(Сообщение, "body");
	Идентификатор = СтроковоеСвойство(Тело, "mid");
	Если Не ПустаяСтрока(Идентификатор) Тогда
		Возврат Идентификатор;
	КонецЕсли;

	Возврат СтроковоеСвойство(ОтветMAX, "mid");

КонецФункции

Функция ВидСообщенияMAX(Вложения)

	Если ТипЗнч(Вложения) <> Тип("Массив") Или Вложения.Количество() = 0 Тогда
		Возврат "text";
	КонецЕсли;

	Возврат СтроковоеСвойство(Вложения[0], "type", "attachment");

КонецФункции

Функция JSONВложенийMAX(Вложения)

	Если ТипЗнч(Вложения) <> Тип("Массив") Или Вложения.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;

	Попытка
		Возврат СтруктураВJSON(Вложения);
	Исключение
		Возврат "";
	КонецПопытки;

КонецФункции

Функция ЭтоКомандаMAX(ТекстСообщения)

	Возврат ЗначениеЗаполнено(ТекстСообщения) И Лев(СокрЛП(ТекстСообщения), 1) = "/";

КонецФункции

Функция КомандаИзТекста(ТекстСообщения)

	ЧастиКоманды = СтрРазделить(СокрЛП(ТекстСообщения), " ");
	Если ЧастиКоманды.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;

	Возврат ЧастиКоманды[0];

КонецФункции

Функция СтроковоеСвойство(Данные, ИмяСвойства, ЗначениеПоУмолчанию = "")

	Значение = ЗначениеСвойства(Данные, ИмяСвойства, ЗначениеПоУмолчанию);
	Если Значение = Неопределено Или Значение = Null Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;

	Возврат СокрЛП(Строка(Значение));

КонецФункции

Функция ЗначениеСвойства(Данные, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено)

	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;

	Значение = Неопределено;
	Если Данные.Свойство(ИмяСвойства, Значение) Тогда
		Возврат Значение;
	КонецЕсли;

	Возврат ЗначениеПоУмолчанию;

КонецФункции

Функция СтрокаИдентификатора(Идентификатор)

	Если Идентификатор = Неопределено Или Идентификатор = Null Тогда
		Возврат "";
	КонецЕсли;

	Если ТипЗнч(Идентификатор) = Тип("Число") Тогда
		Возврат Формат(Идентификатор, "ЧГ=0");
	КонецЕсли;

	Возврат СокрЛП(Строка(Идентификатор));

КонецФункции

Процедура ВыполнитьОбработчик(Обработчик, Сообщение, Контакт, Бот)

	Попытка
		УстановитьБезопасныйРежим(Истина);
		Выполнить (СтрШаблон("%1(Сообщение, Контакт, Бот);", Обработчик));
	Исключение
		//@skip-check undefined-type
		ЗаписьЖурналаРегистрации(
			"ОМНИ.MAX.ОшибкаОбработчика", УровеньЖурналаРегистрации.Ошибка, , , 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьСобытиеВЖурнал(Обновление, Бот, Комментарий)

	ТипОбновления = СтроковоеСвойство(Обновление, "update_type");
	ИдентификаторСообщения = "";

	Сообщение = ЗначениеСвойства(Обновление, "message");
	Если ТипЗнч(Сообщение) = Тип("Структура") Тогда
		Тело = ЗначениеСвойства(Сообщение, "body");
		ИдентификаторСообщения = СтроковоеСвойство(Тело, "mid");
	КонецЕсли;

	ЗаписьЖурналаРегистрации(
		"ОМНИ.MAX.Webhook", УровеньЖурналаРегистрации.Информация, , , СтрШаблон("%1. Тип: %2. MessageID: %3",
		Комментарий, ТипОбновления, ИдентификаторСообщения));

КонецПроцедуры

#КонецОбласти
